{"meta":{"title":"Gotcha - Pokemon Go Guide","subtitle":"Everything you need to know about Pokemon Go","description":null,"author":"GWesley","url":"http://g.lalawe.com","root":"/"},"pages":[],"posts":[{"title":"Naming Tricks For Choosing Your Eevee Evolution","slug":"Naming-Tricks-For-Choosing-Your-Eevee-Evolution","date":"2019-09-09T01:01:46.000Z","updated":"2019-09-09T01:04:52.615Z","comments":false,"path":"2019/09/08/Naming-Tricks-For-Choosing-Your-Eevee-Evolution/","link":"2019/09/08/Naming-Tricks-For-Choosing-Your-Eevee-Evolution","permalink":"http://g.lalawe.com/2019/09/08/Naming-Tricks-For-Choosing-Your-Eevee-Evolution/","excerpt":"","text":"https://www.eurogamer.net/articles/2019-04-15-pokemon-go-eevee-evolution-how-to-evolve-eevee-vaporeon-jolteon-flareon-umbreon-espeon-leafeon-glaceon How to evolve Eevee continues to be one of the bigger talking points in Pokémon Go. In the classic Pokémon games, Eevee can evolve into different typing varieties - known as Eeveelutions by names - based on the use of special items, its happiness level, moves it has available and even the time of day. With Candy in Pokémon Go, the way you evolve Pokémon is much simpler, and as such, you cannot use the tried-and-tested method of using one of three elemental stones to turn Eevee into Flareon, Jolteon and Vaporeon. Once you have caught enough Eevees to evolve one - our pages on finding Pokemon by location, finding which Pokemon hatch from which eggs and locating Pokémon nests near you can help - a neat trick will get you the evolution you need by using a special Eevee name. Here’s how Eevee evolutions work. If you choose to evolve Eevee without any meddling - by feeding it 25 Eevee candy - then it’ll turn to one of the below seven types at random. However, players have discovered a trick that allows you to target any of Leafeon, Glaceon, Espeon, Umbreon, Flareon, Jolteon or Vaporeon by using one of the following Eevee names: Rename Eevee as Linnea to evolve into leaf-type Leafeon Rename Eevee as Rea to evolve into ice-type Glaceon Rename Eevee as Sakura to evolve into psychic-type Espeon Rename Eevee as Tamao to evolve into dark-type Umbreon Rename Eevee as Rainer to evolve into water-type Vaporeon Rename Eevee as Sparky to evolve into lightning-type Jolteon Rename Eevee as Pyro to evolve into fire-type Flareon Important note - the trick only works once per evolution type, so make sure you choose Eevees with the best CP values before you evolve them into the type you want. Thanks to McLovin1019 on reddit for confirming the new Leafeon and Glaceon evolution names. That said, for select Eevee evolutions, its possible to get the specific types you want through a second method… Alternate Eevee evolution methods for Leafeon, Glaceon, Umbreon and EspeonGen 4’s Leafeon and Glaceon have a second Eevee evolution method, by using the Mossy Lure or Glacial Lure respectively. When you’re in range of that PokéStop with the Lure enabled, go to your Eevee and choose the Evolution. Meanwhile, Gen 2’s Umbreon and Espeon also have a second Eevee evolution method. Walk your Eevee as a Buddy for 10km, then evolve it either during the night (Umbreon) or day (Espeon) and it’ll turn into the desired evolution. Note you specifically need to walk 10k and earn two Candies in the process, then keep Eevee as your Buddy when evolving, and be either day or night during the game itself for it to work (thanks to Daviebruce72 on reddit for clarifying). Since the naming trick only works once per evolution type, this appears to be a useful way to get a second Espeon or Umbreon with some reliability. What you need to know about Eevee Evolution names in Pokémon Go Why Sakura, Tamao, Sparky, Rainer and Pyro? The original three are the names of the Eevee brothers from the Pokémon television show, who meet with Ash and the gang in episode 40 to show off their respective Eevee evolutions, with Sakura and Tamao appearing later on in the series. Once you have called your Eevee into one of the above names, you should quit and reload the app to double check the name change has taken place, which is important considering the servers can lean to be on the unreliable side. Once you’ve double checked the new name is indeed in place, then evolve the Eevee as you would any other Pokémon by feeding it Candy, and it should take the form of your chosen type. All Eevee evolutions - bar Sylveon - are available in Pokémon Go. _The first Ultra Bonus rewards are here, including the arrival of Raikou, Entei and Suicune in raids and Unown in Eggs. Elsewhere, after a summer teasing its arrival, the Jirachi quest is available to be completed. We soon have the first Gen 5 Pokémon to look forward to - until then, be sure to keep on top of Team Rocket Invasions and freeingShadow Pokémon, as well as catching monthly Field Research rewards._ How do you evolve Eevee into Sylveon in Pokémon Go? Eevee evolution Sylveon If you want to get your hands on the final Eevee evolution in Pokémon Go, then you’re out of luck - you can’t just yet. So far, Pokémon Go has added Eevee evolutions for the first four Generations of creatures, which means Eevee can only evolve into Leafeon, Glaceon, Umbreon, Espeon, Flareon, Jolteon and Vaporeon for now. That leaves just Sylveon to go. Since it’s from Gen 6, it’ll be a good while yet, but you can be sure there’ll be a Eevee evolution name to go with it.","categories":[],"tags":[]},{"title":"Team Rocket And Shadow Pokemon","slug":"Team-Rocket-And-Shadow-Pokemon","date":"2019-09-08T13:54:30.000Z","updated":"2019-09-09T01:05:10.700Z","comments":false,"path":"2019/09/08/Team-Rocket-And-Shadow-Pokemon/","link":"2019/09/08/Team-Rocket-And-Shadow-Pokemon","permalink":"http://g.lalawe.com/2019/09/08/Team-Rocket-And-Shadow-Pokemon/","excerpt":"","text":"https://www.gamesradar.com/pokemon-go-shadow-pokemon-list/ There’s been another update to the list of Pokemon Go shadow Pokemon, as Team Rocket has corrupted even more pocket monsters. Shadow Pokemon like Oddish, Larvitar, and Turtwig can now be caught when taking down a Team Rocket pokestop, enticing more players to tackle them in the hopes of catching more shadow Pokemon in Pokemon Go. Much like the Pokemon on the Pokemon Go shiny list, collecting all of the Pokemon Go shadow Pokemon is a lofty goal for trainers around the world and with the latest additions, it’s become even more difficult. What are Pokemon Go shadow Pokemon? Shadow Pokemon in Pokemon Go are some Pokemon that Team Rocket have brought with them. Whenever you defeat a Team Rocket GO Grunt at a pokestop they’ve taken over, you’ll have the opportunity to catch a shadow Pokemon that they’ve left behind. They’re easily distinguishable due to the purple aura around them, red eyes, and when you catch them, you’ll notice that their CP is significantly lower than you’d expect. BulbasaurIvysaurVenusaurCharmanderCharmeleonCharizardSquirtleWartortleBlastoiseRattataRaticateZubatGolbatCrobatOddishGloomVileplumeBellossomVenonatVenomothPsyduckGolduckGrowlitheArcaninePoliwagPoliwhirlPoliwrathPolitoedAbraKadabraAlakazamGrimerMukDrowzeeHypnoCuboneMarowakHitmonchanScytherScizorMagikarpGyaradosSnorlaxDratiniDragonairDragoniteHoundourHoundoomLarvitarPupitarTyranitarMudkipMarshtompSwampertRaltsKirliaGardevoirGalladeTurtwigGrotleTorterra We’ll continue to update this list whenever new shadow Pokemon are released and until then, get out there and save those Pokemon!","categories":[],"tags":[]},{"title":"How To Catch Ditto","slug":"How-To-Catch-Ditto","date":"2019-09-08T13:42:34.000Z","updated":"2019-09-09T01:03:43.930Z","comments":false,"path":"2019/09/08/How-To-Catch-Ditto/","link":"2019/09/08/How-To-Catch-Ditto","permalink":"http://g.lalawe.com/2019/09/08/How-To-Catch-Ditto/","excerpt":"","text":"https://www.imore.com/how-catch-ditto-pokemon-go Ditto is a Pokémon who can transform — essentially take on the appearance and attributes of other Pokémon. Although missing from the original release of Pokémon Go Gen 1, Ditto eventually found its way out into the world, hiding as Pidgy, Ratatta, Zubat, and Magikarp. With Gen 2, Ditto also learned to hide as Sentra, Yanma, and Hoothoot, and Gen 3, as Zigzagoon and Taillow. Then, when Shiny Magikarp appeared, Ditto Magikarp disappeared. Now, just as Ditto has become a prerequisite for finding the mythical Mew, Ditto has added Whismur, Gulpin, Paras, and Remoraid to its repertoire as well, and now Meltan as well. So, come out, come out, wherever you are. It’s time to play hunt and go catch! Which Pokémon can be Ditto?As of August 2019: Paras Sentret Yanma Hoothoot Whismur Gulpin Remoraid Ledyba Venonat February 28, 2019: Ditto can now be Venonat or Ledyba, can no longer be Pidgey or RatattaThanks to the arrival of Shiny Pidget and Ratatta, which means they can no longer be Ditto in disguised — because anyone catching a Shiny only to see it turn into a non-Shiny Ditto would be super sad/mad — Pokémon Go has swapped them out for Venonaut and Ledyba. So, make sure you keep checking Pidget and Ratatta for the chance at a Shiny but now also check Ledyba and Venonat for a chance at a Ditto. What’s Ditto and why do you want it?Ditto is one of the first generation Pokémon that wasn’t available at the launch of Pokémon Go game. It took a while for that to change. You want Ditto because the hiding mechanic isn’t just cool, you need it to complete your Pokédex. Here’s the official announcement: Professor Willow has finally discovered Ditto! Trainers all over the world have been reporting its appearance. Ditto has been known to disguise itself as other Pokémon, so keep an eye out, some Pokémon may actually be Ditto, and when you capture them, there’s a chance that Ditto will reveal itself. If you do encounter a Pokémon that is Ditto in disguise, the Pokémon in that specific encounter will also reveal itself as Ditto for other Trainers. Ditto is also a unique Pokémon when you interact with Gyms. When training or battling at a Gym, Ditto will copy the appearance, types, and moves of the first Pokémon it sees, and it will stay that way through the remainder of those Gym battles. And now you also need Ditto to find Mew?Yes, as part of the spring 2018 research update, Pokémon Go added a Mythical Discovery quest. One of the tasks of the 5th part is catching a Ditto. You need do that before you can advance on and find — and try to catch — Mew. So Ditto hides as other Pokémon?Yup! Ditto can transform into other Pokémon and, so far, he’s only being encountered in the wild in his transformed state. That means you can’t see Ditto on Nearby or Sightings, and you won’t know if he’s spawned right next to you until you catch him. It’s only then you’ll be greeted with an “Oh?” instead of a “Gotcha!” and he’ll be revealed as Ditto. So, you gotta catch’em all. Literally. Because any one of them could be Ditto. In terms of game mechanics, how that seems to work is anytime you catch what could be a Ditto in disguise, the Pokémon Go servers randomly determine if it’s secretly a Ditto or not. So, until it’s caught, it’s not a Ditto and can’t be detected as a Ditto at all. Once it’s caught and is determined to be a Ditto, anyone who catches the same Pokémon will also have it revealed to be a Ditto. Schrodinger’s Pokemon, do be sure! Which Gen 1 Pokémon can be Ditto in disguise?Ditto hides as a base-level, very common Pokémon. In Gen 1, that includes: 1, Venonat 1. Paras Wait, no more Ditton hiding as Magikarp, Pidget, or Rattata?No, not since Shiny Magikarp came out and the reaction to losing a Shiny Karp to a non-Shiny Ditto was… extreme. Pokémon Go fixed it in days by telling Ditto it could no longer hide in Magikarp. The same has now happened to Pidget and Rattata thanks to their Shiny versions becoming available. Which Gen 2 Pokémon can be Ditto in disguise? Gen 2 only has four Ditto candidates so far, and one of them is typically far less common than all the others: Hoothoot Sentret Yanma Ledyba Which Gen 3 Pokémon can be Ditto in disguise? Whismur Gulpin Ugh, so you really have to catch a bunch of commons?Yeah, but remember, you can use many of them to grind out XP so even if they aren’t Ditto. So, it’s not time/effort completely wasted. Is there any way to speed up the Ditto catching process?Yes. Crowd-source it. If you’re already part of a local Pokémon Go community on Discord, Facebook Messenger, WhatsApp, Slack, or a similar service, for example, for organizing Raids, ask everyone to post their Ditto encounters so you can try to get to one live. You may want to make a separate group or room for Ditto hunting so you don’t spam players who already have Ditto, but as long as it’s local, it should increase your chances. How do I catch Ditto when I find it?Since Ditto hides as common Pokémon, you catch it in the same way. Some common Pokémon are harder to catch than you’d expect — thanks, Pokémon Go! — especially if they’re low stat (IV) and high level. That’s where the CP looks low but they’re a huge pain to catch. Ditto tends to fall into that category as well. The usual rules apply, though. Always go for curveballs, and stack as many bonuses as you can and have at them! How to stack bonuses to catch tough Pokémon in Pokémon Go! Where can I catch Ditto?Ditto doesn’t have nests or spawn points, per se, but the Pokémon that could be Ditto in disguise certainly do. Some areas, including PokéStops, Gyms, parking lots, malls, etc. have spawn points where multiple Pokémon appear at once and most of them are the really common kind. That’s perfect for Ditto. I caught my first Ditto in the parking lot of a McDonald’s. I’ve caught others at spawn points on street corners and food courts. If you see two Rattata or a couple of Pidgey, you can catch them all and play the odds on getting a Ditto. Can I get Ditto with Incense and Lures?The second Ditto I caught was from Incense, and so were the next four or so as well. Lures also work. That means you can drop one or the other and, instead of focusing on a rare, focus on the four to six commons that appear. Catch those and hope for the best. So, if you have a favorite route or favorite place to hang, drop some Incense or a Lure and, fingers crossed, let Ditto come to you. Is Ditto random or can everyone catch him?If you catch a Gulpin and it turns out to be Ditto, anyone else who catches that Gulpin will also see it transform into Ditto. In other words, once a Pokémon is revealed as Ditto, it’s consistently Ditto for everyone. So, if you’re playing as a family or are out in a group and one of you catches Ditto, let everyone else know and you’ll all get Ditto. Dividing and conquering is a great way to churn through a lot of low-level spawns at once as well. Can I catch Ditto with the Pokémon Go Plus?Yes, absolutely! It’ll try to catch Ditto just like it would the Pokémon Ditto’s pretending to be. Catch that Pokémon and you’ve caught Ditto. But remember, Pokémon Go Plus only throws normal Poké Balls, so there’s also a chance the Pokémon will run and you’ll never know whether or not it was a Ditto. How does Ditto work in Gyms and Raids? Ditto only has one moveset: Transform and Struggle. Transform does zero damage but, instead, immediately changes Ditto in the same Pokémon he’s fighting. That’s true whether he’s defending a Gym or attacking it, for training or for taking down. He also takes on the attributes of the Pokémon he’s mimicking, though there are some reports that his exact CP will vary based on his level rather than the level of the Pokémon he’s copying. And, of course, a Ditto transforming into another Ditto stays the same.","categories":[],"tags":[]},{"title":"How To Get The Highest IV And CP Values","slug":"How-To-Get-The-Highest-IV-And-CP-Values","date":"2019-09-06T19:30:15.000Z","updated":"2019-09-09T01:03:21.254Z","comments":false,"path":"2019/09/06/How-To-Get-The-Highest-IV-And-CP-Values/","link":"2019/09/06/How-To-Get-The-Highest-IV-And-CP-Values","permalink":"http://g.lalawe.com/2019/09/06/How-To-Get-The-Highest-IV-And-CP-Values/","excerpt":"","text":"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002 Much like the main Pokémon games, alongside the standard combat modifiers like Type advantages and weaknesses, it turns out Pokémon Go has a whole secret layer of stats for every creature in the game, with hidden values for a Pokémon’s Attack, Defence, and Stamina that’s linked to their CP. And like the main Pokémon games, it’s possible to expose these values and maximise them to make your Pokémon as strong as possible. Stronger, higher CP Pokémon - along with Pokémon that have the most powerful, highest DPS moves, means winning more battles, winning more battles means taking more Gyms, allowing you to get free PokeCoins (and pride) in the process. So what exactly are all these hidden stats, what do they mean, and how can you use them to get the best, strongest Pokémon in Pokémon Go with the maximum CP possible? Thanks to the work of Pokémon Go community The Silph Road, we know how. On this page: How to find out approximate CP and IV values within Pokémon Go with the Appraisal feature How should you use the new Appraisal feature? Pokémon Go CP explained: What is CP and how is CP calculated? How to get the highest CP and IVs in Pokémon Go How to find out approximate CP and IV values within Pokémon Go with the Appraisal featureNiantic originally released the Appraisal feature in 2016 in an effort to combat third-party apps. While the feature was useful, the information it gave about a Pokémon’s CP and IV value was rather vague. After three years, however, Niantic has revamped the feature, making it much easier to discover which of your Pokémon are the very best. To get an Appraisal of your Pokémon, tap the menu in the bottom right corner and select Appraisal when viewing, and then your chosen Team Leader will give you the rundown. The new Appraisal feature is divided into two stages. In the first stage, your chosen Team Leader will comment on the size of your Pokémon, telling you how small or how bizarrely big your Pokémon is. This information doesn’t factor into the prowess of battle - so feel free to ignore it. In the second stage, the Team Leader will tell you when or where you caught the Pokémon (if that information has been recorded), but, more importantly, they’ll show you the Pokémon stats - Attack, Defence and HP. A Pokémon with perfect stats. Each stat has a bar that shows you where it ranks out of 15 on the IV scale. To help communicate this information, the stat bars are divided into three different sections: First section - 1 to 5 Second section - 6 to 10 Third section - 11 to 15 The higher the IV stat, the better the Pokémon’s Attack, Defence or HP will be. If a stat has an IV ranking of 15 - the maximum possible stat - then the bar will be coloured red. On the other hand, if a stat bar is completely empty, then the IV ranking for that stat is 0. These three stats are then combined into an overall CP and IV ranking for a Pokémon. To give you a quick look at the overall status of your Pokémon, Niantic has created a set of star tiers: 0 stars - below 50% 1 star - 51% to 63.4% 2 stars - 66.7% to 80% 3 stars - 82.2% to 98% 3 stars with a red background - 100% The range of star tiers your Pokémon could have. _Thank you to ricktasticdbs from reddit for their help breaking down the new Appraisal system._ How should you use the new Appraisal feature?The new Appraisal feature is a great way to quickly discover how powerful your new Pokemon are. Finding out that an old favourite has a three star rating is incredibly gratifying. It’s especially useful for when you’re comparing a bunch of the same Pokémon, as you can keep the stat appraisal screen open as you move between Pokémon. This allows you to quickly compare stats and star rankings as you try to decide which Pokémon to keep and which ones to release. You can even search for Pokémon by their specific star tier, just like how you can search for them by name. To do this, you’ll need to search: 0* = 0 Stars 1* = 1 Star 2* = 2 Stars 3* = 3 Stars 4* = 3 Stars with a red background / 100% Pokémon The new ranking system makes it a lot easier to decide which Pokémon are worth investing your Stardust and Candy in. Though it’s still important to remember a Pokémon’s rarity and whether it’s one of the best Pokémon in the game. Though by and large the closer to 100% this is the better, depending on the Pokémon, some individual stats are more important than others - so it isn’t the be all and end all. For example, if you have a Snorlax - one of the best creatures to put in a gym with its high health - with a low HP stat, that makes it a less attractive proposition. But then again, because it’s rare, you might not have any alternative Snorlax to rely on. Of course, an average Snorlax will still perform better than others in its field, so it could still be worth Powering up. Conversely, if it has a low Attack but a high HP and Defence, then that makes the Snorlax well worth investing in. So, while the new Appraisal feature is going to help you decide which Pokémon to keep, you’re still going to want to know which Pokémon you should be targeting out in the wild. Read on for some more tips on finding Pokémon with the highest CP and IV. Pokémon Go CP explained: What is CP and how is CP calculated?CP, or Combat Points, is a measure of how strong your Pokémon will be in battle against another Pokémon, and is actually a combination of several hidden stats. Each Pokémon in Pokémon Go has a set of Base Stats for Attack, Defence, and Stamina, along with a hidden Level and a hidden modifier for those Base Stats, known as a Pokémon’s IVs. Dragonite’s CP is 3792. It’s not worth going into too much detail on how all of those stats work (you can read the nitty gritty details over at this fan-run wiki) but they can essentially be explained with a nice little analogy about dogs: Greyhounds, often used for dog racing, are a naturally fast breed of dog. Bulldogs, not so fast. Just like Greyhounds are naturally speedy, Dragonites, as a Pokémon species, have naturally high Attack - or, in other words, a naturally high Base Stat for Attack - contrast that with Machokes which, despite having decent Attack, are somewhat puny by comparison. However, every now and then you might get a Greyhound that is so slow, and a Bulldog that is so fast, that out of these two individual dogs the Bulldog is actually faster. So, in Pokémon Go, you might get such a naturally low-Attack Dragonite, and naturally high-Attack Machoke, that you’ll hit the point where the Machoke actually has a higher overall Attack than the Dragonite. That’s because the Individual Values of the Machoke - basically its genes - are considerably stronger than those of the Dragonite. In Pokémon Go, IVs are given a value out of 15 for each stat, so a spread of 15/15/15 across Attack, Defence, and Stamina would be considered perfect IVs. The curved white bar indicates how far you’ve levelled up your Pokémon. Finally, you have the Pokémon Level. In brief, a Pokémon Level is like how hard the Pokémon has been training, so again, a more well-trained Machoke with a higher Level might have an overall higher Attack than an untrained Dragonite. Raising a Pokémon’s Level is easy enough - each time you use the Power Up function in-game, it raises that Pokémon by half a level. Note that the Level always caps out at a maximum of 1.5 Levels above your own Trainer Level, but that maximum does still increase alongside your Trainer Level over time. You can get a rough estimate of a Pokémon’s Level from the white curved bar above its head - a bar all the way to the right means the Pokémon is at its current maximum Level, and a bar all the way to the left means it’s at its minimum Level, which is always Level 1. So, a combination of a Pokémon’s hidden Base Stats, IVs, and Level are what dictate its CP - the higher the better, but remember that just because that Drowzee you caught has higher CP than your old one, that doesn’t necessarily mean it’s stronger. It might just be a higher Level. _The first Ultra Bonus rewards are here, including the arrival of Raikou, Entei and Suicune in raids and Unown in Eggs. Elsewhere, after a summer teasing its arrival, the Jirachi quest is available to be completed. We soon have the first Gen 5 Pokémon to look forward to - until then, be sure to keep on top of Team Rocket Invasions and freeingShadow Pokémon, as well as catching monthly Field Research rewards._ How to get the highest CP and IVs in Pokémon GoThe best Pokémon in Pokémon Go - in terms of battling that is; you might think Jigglypuff’s the best looking, and more power to you - is the Pokémon with the highest possible CP when it’s at maximum Level, with perfect IVs. Here’s how you do it, step by step: Pick your Pokémon from our ranked list of the strongest Pokémon in Pokémon Go. Go and catch it! You can use our list of all possible Pokémon locations for help, but it’s worth mentioning that there are sources where Pokémon are often higher IVs than those caught in the wild, including: Pokémon caught from Raids Pokémon caught from Field Research Pokémon hatched from Eggs Lucky Pokémon from trading Purified Shadow Pokémon, which add +2 IV points Once you have your Pokémon of choice - let’s say a Dratini - you then need to figure out whether it’s any good. To do that, you’ll need to find its Level and IVs, which are invisible in-game. But worry not! The community have put together a variety of IV calculators, which give you a percentage estimate for how good your Dratini’s IVs are. Our recommendation is the Silph Road, a community site with its own IV calculator. A perfect 15/15/15 set of IVs will come out as 4* in search or 100% in a calculator, so once you’ve found a Dratini which comes out as perfect - or one which is close enough to perfect for you to be happy - then it’s time to evolve it. You can check out our tips for evolving Pokémon in Pokémon Go for more detail, but generally it’s advisable to evolve your high-IV Pokémon before you start spending Stardust to Power Up and increase its Level. That’s because each time a Pokémon evolves, although its IVs stay the same, its moveset is randomised. So you might end up with that genetically perfect Dragonite, only for it to have a rubbish set of moves that spoil all your hard work finding it. Finally, once you’re happy with your perfect IV Dragonite, with the perfect moveset (check our guide to Pokémon Go moves and movesets for more on that!), it’s time to Power Up your Pokémon to the maximum level. So go find more Dratini, grind them down into Dratini Candies and feed them to your Dragonite. Don’t forget that your Pokémon’s maximum Level increases alongside your own Trainer Level, so your Pokémon won’t be the very best it can be until you yourself hit the cap at Level 40.","categories":[],"tags":[]}]}