{"title":" How to get the highest IV and CP values","date":"2019-09-06T19:30:15.000Z","link":"2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team","updated":"2019-09-08T13:46:29.926Z","content":"<blockquote>\n<p><a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002\" target=\"_blank\" rel=\"noopener\">https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002</a></p>\n</blockquote>\n<p>Much like the main Pokémon games, alongside the standard combat modifiers like <a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-level-rewards-list-level-up-items-max-level\" target=\"_blank\" rel=\"noopener\">Type advantages and weaknesses</a>, it turns out <a href=\"https://www.eurogamer.net/articles/2016-07-21-pokemon-go-players-discover-its-just-as-complex-as-the-main-series\" target=\"_blank\" rel=\"noopener\">Pokémon Go has a whole secret layer of stats</a> for every creature in the game, with hidden values for a Pokémon’s Attack, Defence, and Stamina that’s linked to their CP. And like the main Pokémon games, it’s possible to expose these values and maximise them to make your Pokémon as strong as possible.</p>\n<p>Stronger, higher CP Pokémon - along with Pokémon that have <a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-moves-movesets-move-list-and-highest-dps-attacks\" target=\"_blank\" rel=\"noopener\">the most powerful, highest DPS moves</a>, means winning more battles, winning more battles means taking more Gyms, allowing you to get free PokeCoins (and pride) in the process.</p>\n<p>So what exactly are all these hidden stats, what do they mean, and how can you use them to get the best, strongest Pokémon in Pokémon Go with the maximum CP possible? Thanks to the work of Pokémon Go community <a href=\"https://www.reddit.com/r/TheSilphRoad/\" target=\"_blank\" rel=\"noopener\">The Silph Road</a>, we know how.</p>\n<p>On this page:</p>\n<ul>\n<li><a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002#section-1\" target=\"_blank\" rel=\"noopener\">How to find out approximate CP and IV values within Pokémon Go with the Appraisal feature</a></li>\n<li><a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002#section-2\" target=\"_blank\" rel=\"noopener\">How should you use the new Appraisal feature?</a></li>\n<li><a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002#section-3\" target=\"_blank\" rel=\"noopener\">Pokémon Go CP explained: What is CP and how is CP calculated?</a></li>\n<li><a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-cp-meaning-explained-how-to-get-the-highest-cp-values-create-the-most-powerful-team-6002#section-4\" target=\"_blank\" rel=\"noopener\">How to get the highest CP and IVs in Pokémon Go</a></li>\n</ul>\n<h2 id=\"How-to-find-out-approximate-CP-and-IV-values-within-Pokemon-Go-with-the-Appraisal-feature\">How to find out approximate CP and IV values within Pokémon Go with the Appraisal feature<a href=\"2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team#How-to-find-out-approximate-CP-and-IV-values-within-Pokemon-Go-with-the-Appraisal-feature\"></a></h2><p>Niantic originally released the <a href=\"https://www.eurogamer.net/articles/2016-08-23-pokemon-go-update-adds-new-appraisal-feature-for-finding-a-monsters-pokepotential\" target=\"_blank\" rel=\"noopener\">Appraisal feature in 2016</a> in an effort to combat third-party apps. While the feature was useful, the information it gave about a Pokémon’s CP and IV value was rather vague. After three years, however, Niantic has revamped the feature, making it much easier to discover which of your Pokémon are the very best.</p>\n<p>To get an Appraisal of your Pokémon, tap the menu in the bottom right corner and select Appraisal when viewing, and then your <a href=\"https://www.eurogamer.net/articles/2019-02-27-pokemon-go-team-change-valor-mystic-instinct-which-to-join-6002\" target=\"_blank\" rel=\"noopener\">chosen Team Leader</a> will give you the rundown.</p>\n<p>The new Appraisal feature is divided into two stages.</p>\n<p>In the first stage, your chosen Team Leader will comment on the size of your Pokémon, telling you how small or how bizarrely big your Pokémon is. This information doesn’t factor into the prowess of battle - so feel free to ignore it.</p>\n<p>In the second stage, the Team Leader will tell you when or where you caught the Pokémon (if that information has been recorded), but, more importantly, they’ll show you the Pokémon stats - Attack, Defence and HP.</p>\n<p><img src=\"https://d2skuhm0vrry40.cloudfront.net/2019/articles/2019-07-17-11-42/Pokemon_Go_Max_Stats_Appraise.jpg/EG11/resize/300x-1/quality/75/format/jpg\" alt> A Pokémon with perfect stats.</p>\n<p>Each stat has a bar that shows you where it ranks out of 15 on the IV scale. To help communicate this information, the stat bars are divided into three different sections:</p>\n<ul>\n<li>First section - 1 to 5</li>\n<li>Second section - 6 to 10</li>\n<li>Third section - 11 to 15</li>\n</ul>\n<p>The higher the IV stat, the better the Pokémon’s Attack, Defence or HP will be.</p>\n<p>If a stat has an IV ranking of 15 - the maximum possible stat - then the bar will be coloured red. On the other hand, if a stat bar is completely empty, then the IV ranking for that stat is 0.</p>\n<p>These three stats are then combined into an overall CP and IV ranking for a Pokémon. To give you a quick look at the overall status of your Pokémon, Niantic has created a set of star tiers:</p>\n<ul>\n<li>0 stars - below 50%</li>\n<li>1 star - 51% to 63.4%</li>\n<li>2 stars - 66.7% to 80%</li>\n<li>3 stars - 82.2% to 98%</li>\n<li>3 stars with a red background - 100%</li>\n</ul>\n<p>The range of star tiers your Pokémon could have.</p>\n<p>_Thank you to <a href=\"https://www.reddit.com/r/TheSilphRoad/comments/ce6dza/new_appraisal_infographic/\" target=\"_blank\" rel=\"noopener\">ricktasticdbs</a> from reddit for their help breaking down the new Appraisal system._</p>\n<h2 id=\"How-should-you-use-the-new-Appraisal-feature\">How should you use the new Appraisal feature?<a href=\"2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team#How-should-you-use-the-new-Appraisal-feature\"></a></h2><p>The new Appraisal feature is a great way to quickly discover how powerful your new Pokemon are. Finding out that an old favourite has a three star rating is incredibly gratifying.</p>\n<p>It’s especially useful for when you’re comparing a bunch of the same Pokémon, as you can keep the stat appraisal screen open as you move between Pokémon. This allows you to quickly compare stats and star rankings as you try to decide which Pokémon to keep and which ones to release.</p>\n<p><img src=\"https://www.eurogamer.net/img/placeholder.jpg\" alt class=\"article-img\"></p>\n<p>You can even search for Pokémon by their specific star tier, just like how you can search for them by name. To do this, you’ll need to search:</p>\n<ul>\n<li>0* = 0 Stars</li>\n<li>1* = 1 Star</li>\n<li>2* = 2 Stars</li>\n<li>3* = 3 Stars</li>\n<li>4* = 3 Stars with a red background / 100% Pokémon</li>\n</ul>\n<p>The new ranking system makes it a lot easier to decide which Pokémon are worth investing your Stardust and Candy in. Though it’s still important to remember a <a href=\"https://www.eurogamer.net/articles/2017-10-10-pokemon-go-rare-pokemon-list-chart\" target=\"_blank\" rel=\"noopener\">Pokémon’s rarity</a> and whether it’s one of the <a href=\"https://www.eurogamer.net/articles/2019-08-01-pokemon-go-best-pokemon-5392\" target=\"_blank\" rel=\"noopener\">best Pokémon in the game</a>.</p>\n<p>Though by and large the closer to 100% this is the better, depending on the Pokémon, some individual stats are more important than others - so it isn’t the be all and end all.</p>\n<p>For example, if you have a Snorlax - one of the best creatures to put in a gym with its high health - with a low HP stat, that makes it a less attractive proposition. But then again, because it’s rare, you might not have any alternative Snorlax to rely on. Of course, an average Snorlax will still perform better than others in its field, so it could still be worth Powering up.</p>\n<p>Conversely, if it has a low Attack but a high HP and Defence, then that makes the Snorlax well worth investing in.</p>\n<p>So, while the new Appraisal feature is going to help you decide which Pokémon to keep, you’re still going to want to know which Pokémon you should be targeting out in the wild. Read on for some more tips on finding Pokémon with the highest CP and IV.</p>\n<h2 id=\"Pokemon-Go-CP-explained-What-is-CP-and-how-is-CP-calculated\">Pokémon Go CP explained: What is CP and how is CP calculated?<a href=\"2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team#Pokemon-Go-CP-explained-What-is-CP-and-how-is-CP-calculated\"></a></h2><p>CP, or Combat Points, is a measure of how strong your Pokémon will be in battle against another Pokémon, and is actually a combination of several hidden stats. Each Pokémon in Pokémon Go has a set of Base Stats for Attack, Defence, and Stamina, along with a hidden Level and a hidden modifier for those Base Stats, known as a Pokémon’s IVs.</p>\n<p><img src=\"https://www.eurogamer.net/img/placeholder.jpg\" alt>Dragonite’s CP is 3792.</p>\n<p>It’s not worth going into too much detail on how all of those stats work (you can read the nitty gritty details over at <a href=\"http://pokemongo.gamepress.gg/pokemon-stats-advanced\" target=\"_blank\" rel=\"noopener\">this fan-run wiki</a>) but they can essentially be explained with a nice little analogy about dogs:</p>\n<p>Greyhounds, often used for dog racing, are a naturally fast breed of dog. Bulldogs, not so fast. Just like Greyhounds are naturally speedy, Dragonites, as a Pokémon species, have naturally high Attack - or, in other words, a naturally high Base Stat for Attack - contrast that with Machokes which, despite having decent Attack, are somewhat puny by comparison.</p>\n<p>However, every now and then you might get a Greyhound that is so slow, and a Bulldog that is so fast, that out of these two individual dogs the Bulldog is actually faster.</p>\n<p>So, in Pokémon Go, you might get such a naturally low-Attack Dragonite, and naturally high-Attack Machoke, that you’ll hit the point where the Machoke actually has a higher overall Attack than the Dragonite. That’s because the Individual Values of the Machoke - basically its genes - are considerably stronger than those of the Dragonite.</p>\n<p>In Pokémon Go, IVs are given a value out of 15 for each stat, so a spread of 15/15/15 across Attack, Defence, and Stamina would be considered perfect IVs.</p>\n<p><img src=\"https://www.eurogamer.net/img/placeholder.jpg\" alt>The curved white bar indicates how far you’ve levelled up your Pokémon.</p>\n<p>Finally, you have the Pokémon Level. In brief, a Pokémon Level is like how hard the Pokémon has been training, so again, a more well-trained Machoke with a higher Level might have an overall higher Attack than an untrained Dragonite.</p>\n<p>Raising a Pokémon’s Level is easy enough - each time you use the Power Up function in-game, it raises that Pokémon by half a level. Note that the Level always caps out at a maximum of 1.5 Levels above your own Trainer Level, but that maximum does still increase alongside your Trainer Level over time.</p>\n<p>You can get a rough estimate of a Pokémon’s Level from the white curved bar above its head - a bar all the way to the right means the Pokémon is at its current maximum Level, and a bar all the way to the left means it’s at its minimum Level, which is always Level 1.</p>\n<p>So, a combination of a Pokémon’s hidden Base Stats, IVs, and Level are what dictate its CP - the higher the better, but remember that just because that Drowzee you caught has higher CP than your old one, that doesn’t <em>necessarily</em> mean it’s stronger. It might just be a higher Level.</p>\n<hr>\n<p>_The first <a href=\"https://www.eurogamer.net/articles/2019-06-11-pokemon-go-global-challenge-dates-6002\" target=\"_blank\" rel=\"noopener\">Ultra Bonus rewards</a> are here, including the arrival of <a href=\"https://www.eurogamer.net/articles/2019-08-02-pokemon-go-raikou-counters-weaknesses-6002\" target=\"_blank\" rel=\"noopener\">Raikou</a>, <a href=\"https://www.eurogamer.net/articles/2019-08-02-pokemon-go-entei-counters-weaknesses-6002\" target=\"_blank\" rel=\"noopener\">Entei</a> and <a href=\"https://www.eurogamer.net/articles/2019-08-02-pokemon-go-suicune-counters-weaknesses-6002\" target=\"_blank\" rel=\"noopener\">Suicune</a> in raids and <a href=\"https://www.eurogamer.net/articles/2017-10-10-pokemon-go-unown-alphabet-pokemon-4819\" target=\"_blank\" rel=\"noopener\">Unown</a> in <a href=\"https://www.eurogamer.net/articles/2019-04-29-pokemon-go-eggs-chart-hatching-2km-5km-7km-10km-eggs\" target=\"_blank\" rel=\"noopener\">Eggs</a>. Elsewhere, after a summer teasing its arrival, the <a href=\"https://www.eurogamer.net/articles/2019-08-21-pokemon-go-jirachi-a-thousand-year-slumber-6002\" target=\"_blank\" rel=\"noopener\">Jirachi quest</a> is available to be completed. We soon have the first <a href=\"https://www.eurogamer.net/articles/2019-07-15-pokemon-go-gen-5-pokemon-list-black-white-6002\" target=\"_blank\" rel=\"noopener\">Gen 5 Pokémon</a> to look forward to - until then, be sure to keep on top of <a href=\"https://www.eurogamer.net/articles/2019-07-23-pokemon-go-team-rocket-pokestop-invasions-6002\" target=\"_blank\" rel=\"noopener\">Team Rocket Invasions</a> and freeing<a href=\"https://www.eurogamer.net/articles/2019-06-27-pokemon-go-shadow-purified-how-to-purify-6002_4\" target=\"_blank\" rel=\"noopener\">Shadow Pokémon</a>, as well as catching monthly <a href=\"https://www.eurogamer.net/articles/2019-06-05-pokemon-go-field-research-tasks-special-research-breakthroughs-6002\" target=\"_blank\" rel=\"noopener\">Field Research rewards</a>._</p>\n<hr>\n<h2 id=\"How-to-get-the-highest-CP-and-IVs-in-Pokemon-Go\">How to get the highest CP and IVs in Pokémon Go<a href=\"2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team#How-to-get-the-highest-CP-and-IVs-in-Pokemon-Go\"></a></h2><p>The best Pokémon in Pokémon Go - in terms of battling that is; you might think Jigglypuff’s the best looking, and more power to you - is the Pokémon with the highest possible CP when it’s at maximum Level, with perfect IVs. Here’s how you do it, step by step:</p>\n<ol>\n<li>Pick your Pokémon from our ranked list of <a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-best-pokemon-highest-hp-attack-defence-stats\" target=\"_blank\" rel=\"noopener\">the strongest Pokémon in Pokémon Go</a>.</li>\n<li>Go and catch it! You can use our list of <a href=\"https://www.eurogamer.net/articles/2017-02-10-pokemon-go-locations-type\" target=\"_blank\" rel=\"noopener\">all possible Pokémon locations</a> for help, but it’s worth mentioning that there are sources where Pokémon are often higher IVs than those caught in the wild, including:</li>\n</ol>\n<ul>\n<li>Pokémon caught from <a href=\"https://www.eurogamer.net/articles/2019-06-19-pokemon-go-raid-hour-raid-battles-raid-passes-raid-rewards-4819\" target=\"_blank\" rel=\"noopener\">Raids</a></li>\n<li>Pokémon caught from <a href=\"https://www.eurogamer.net/articles/2019-06-05-pokemon-go-field-research-tasks-special-research-breakthroughs-6002\" target=\"_blank\" rel=\"noopener\">Field Research</a></li>\n<li>Pokémon hatched from <a href=\"https://www.eurogamer.net/articles/2019-04-29-pokemon-go-eggs-chart-hatching-2km-5km-7km-10km-eggs\" target=\"_blank\" rel=\"noopener\">Eggs</a></li>\n<li><a href=\"https://www.eurogamer.net/articles/2019-04-15-pokemon-go-lucky-pokemon-5392\" target=\"_blank\" rel=\"noopener\">Lucky Pokémon</a> from <a href=\"https://www.eurogamer.net/articles/2018-09-06-pokemon-go-trading-requirements-special-trades-how-to-trade-5392\" target=\"_blank\" rel=\"noopener\">trading</a></li>\n<li><a href=\"https://www.eurogamer.net/articles/2019-06-27-pokemon-go-shadow-purified-how-to-purify-6002_4\" target=\"_blank\" rel=\"noopener\">Purified Shadow Pokémon</a>, which add +2 IV points</li>\n</ul>\n<ol start=\"4\">\n<li>Once you have your Pokémon of choice - let’s say a Dratini - you then need to figure out whether it’s any good. To do that, you’ll need to find its Level and IVs, which are invisible in-game. But worry not! The community have put together a variety of IV calculators, which give you a percentage estimate for how good your Dratini’s IVs are. Our recommendation is the Silph Road, a community site with <a href=\"https://thesilphroad.com/iv-rater\" target=\"_blank\" rel=\"noopener\">its own IV calculator</a>.</li>\n<li>A perfect 15/15/15 set of IVs will come out as 4* in search or 100% in a calculator, so once you’ve found a Dratini which comes out as perfect - or one which is close enough to perfect for you to be happy - then it’s time to evolve it.</li>\n<li>You can check out our tips for <a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-how-to-evolve-special-items-when-to-evolve-or-power-up\" target=\"_blank\" rel=\"noopener\">evolving Pokémon in Pokémon Go</a> for more detail, but generally it’s advisable to evolve your high-IV Pokémon before you start spending Stardust to Power Up and increase its Level. That’s because each time a Pokémon evolves, although its IVs stay the same, its moveset is randomised. So you might end up with that genetically perfect Dragonite, only for it to have a rubbish set of moves that spoil all your hard work finding it.</li>\n<li>Finally, once you’re happy with your perfect IV Dragonite, with the perfect moveset (check our guide to <a href=\"https://www.eurogamer.net/articles/2017-06-30-pokemon-go-moves-movesets-move-list-and-highest-dps-attacks\" target=\"_blank\" rel=\"noopener\">Pokémon Go moves and movesets</a> for more on that!), it’s time to Power Up your Pokémon to the maximum level. So go find more Dratini, grind them down into Dratini Candies and feed them to your Dragonite. Don’t forget that your Pokémon’s maximum Level increases alongside your own Trainer Level, so your Pokémon won’t be the very best it can be until you yourself hit the cap at Level 40.</li>\n</ol>\n","prev":{"title":"How to catch Ditto","link":"2019/09/08/How-to-catch-Ditto"},"plink":"http://g.lalawe.com/2019/09/06/How-to-get-the-highest-IV-and-CP-values-and-create-the-most-powerful-team/","toc":[{"title":"How to find out approximate CP and IV values within Pokémon Go with the Appraisal feature","id":"How-to-find-out-approximate-CP-and-IV-values-within-Pokemon-Go-with-the-Appraisal-feature","index":"1"},{"title":"How should you use the new Appraisal feature?","id":"How-should-you-use-the-new-Appraisal-feature","index":"2"},{"title":"Pokémon Go CP explained: What is CP and how is CP calculated?","id":"Pokemon-Go-CP-explained-What-is-CP-and-how-is-CP-calculated","index":"3"},{"title":"How to get the highest CP and IVs in Pokémon Go","id":"How-to-get-the-highest-CP-and-IVs-in-Pokemon-Go","index":"4"}]}