{"title":"Guide To Getting Curve Ball Excellent Throws","date":"2019-09-06T17:37:21.000Z","link":"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws","updated":"2019-09-15T17:38:15.938Z","content":"<blockquote>\n<p><a href=\"https://pokemongohub.net/user-guides/guide-getting-curve-ball-excellent-throws-almost-every-time/\" target=\"_blank\" rel=\"noopener\">https://pokemongohub.net/user-guides/guide-getting-curve-ball-excellent-throws-almost-every-time/</a></p>\n</blockquote>\n<p>In the world of Pokémon GO, every ounce of XP matters, whether it’s from getting that bonus 100 XP you gain from your 100th Pokémon, all the way to the 50 XP you gain from turning a Poke Stop. But do Nice, Great, Excellent and Curve Ball really matter?</p>\n<p>I am usually a guy who uses Great Throw, and in no way an expert at this art form of throwing, but I do spend awfully a lot of time in with some of the best “Excellent throwers”. Not sure if they’re really the best, but when you spend in excess of 100 hours playing the same game with the same people, cognitive bias tends to happen. Even further, the community I play with, holds an playing <strong>Excellent Throw competition</strong> <strong>on a nightly basis.</strong></p>\n<p>The winner of the competition is usually the first person to 10 Excellent Throws (we shout out at 5 and 7 throws). Occasionally teams are formed and the true game then begins. I myself have entered into these competitions, but to no avail: not because I suck but because these guys I play with are so good.</p>\n<p>So, I did a bit of math and right from the outset you can immediately see that gaining a catch with a Curve ball and Excellent Throw gives you an additional 110 XP. That’s an incredible 110% of bonus XP per catch. It may not seem like a lot, but in an hour grind session when you put on a Lucky Egg, you’re running into some serious power leveling XP.</p>\n<p>Here’s the guide to getting curve ball excellent throws (almost) every time.</p>\n<h2 id=\"Your-Phone-Matters\">Your Phone Matters<a href=\"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws#Your-Phone-Matters\"></a></h2><p>I play Pokemon Go using the Huawei P8 Lite and I’ve gotten used to the lag. Every time I switch it for my friend’s Galaxy S7 Edge which has no lag seize, it’s way easier to throw. Although I’ve adapted to my phones lag I know that playing with a phone that has quicker response time and no lag makes the difference between getting an Excellent or a Nice throw on many occasions.</p>\n<p>Conclusion? <strong>Having a good phone matters.</strong></p>\n<p><a href=\"https://i.imgur.com/PvT09yk.png\" target=\"_blank\" rel=\"noopener\"><img src=\"https://i.imgur.com/PvT09yk.png\" alt></a></p>\n<h2 id=\"Go-for-the-Bulls-Eye\">Go for the Bulls Eye<a href=\"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws#Go-for-the-Bulls-Eye\"></a></h2><p>The Bulls eye is something you’ll start to see the more you play and the more Excellent Throws you get. This technique requires you to follow the size of the circle on the Pokémon that is getting smaller:</p>\n<ul>\n<li>Make that same size circle (with your finger) as the one on the Pokémon you’re targeting</li>\n<li>as it gets smaller so does the one your drawing until you see your bulls eye (Excellent Throw circle)</li>\n<li>adjust your angle so it curves in and throw.</li>\n</ul>\n<p>This technique was suggested loads of time by people that are crazy good at excellent throws and is the foundation of how i found my style of throw.</p>\n<h2 id=\"Figure-out-your-style\">Figure out your style<a href=\"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws#Figure-out-your-style\"></a></h2><p>Find your style. We are created differently so why would we all throw the same way. I’ve seen people hit Excellent Throws using their pinky finger, the ring finger, <strong>their nose</strong> and even without looking. Starting from the right side, the left side, spinning clockwise, spinning anti clockwise, find your style. <strong>Find your style.</strong></p>\n<h2 id=\"Join-Excellent-Throw-Competitions\">Join Excellent Throw Competitions<a href=\"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws#Join-Excellent-Throw-Competitions\"></a></h2><p>One of the things that has helped improve my Excellent throws is the introduction of the Excellent Throw competitions within our Pogo Community. <strong>The First person to hit a set amount of Excellent Throws wins.</strong> Excellent with no curve is half a point and Excellent with Curve on a Weddle is 2 points.</p>\n<p>A bit competition, pressure and focus goes a long way to improving that Excellent regardless of the outcome of the competition.</p>\n<h2 id=\"Practice\">Practice<a href=\"2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws#Practice\"></a></h2><p>The most obvious tip is to practice, a lot. This isn’t the lazy thumb flick and yup I’ve practiced heaps. This is focusing and practicing on hitting that small circle and keeping at it until it eventually becomes that lazy thumb flick by default.</p>\n<p>I asked around among my POGO community to see what the longest streak of consecutive excellent throws and the response was insane 6, 9 and then a whopping 11. These trainers had mastered the excellent throw and once it made sense to them, they managed to level up fast. Their levels are 40, 40 and 38.</p>\n<p>At the end of the day I’m content with Great Throws (and so should you be), but hitting those Excellent Throws every time should be the dream. For now, I don’t mind trying every time, at least I get a Great throw if I miss an Excellent.</p>\n","prev":{"title":"How To Catch Ditto?","link":"2019/09/08/How-To-Catch-Ditto"},"plink":"http://g.lalawe.com/2019/09/06/Guide-To-Getting-Curve-Ball-Excellent-Throws/","toc":[{"title":"Your Phone Matters","id":"Your-Phone-Matters","index":"1"},{"title":"Go for the Bulls Eye","id":"Go-for-the-Bulls-Eye","index":"2"},{"title":"Figure out your style","id":"Figure-out-your-style","index":"3"},{"title":"Join Excellent Throw Competitions","id":"Join-Excellent-Throw-Competitions","index":"4"},{"title":"Practice","id":"Practice","index":"5"}]}